package application;

public class Joke {

	public static final String  JOKES[] = {
			"พอลล่ากระโดดลงไปในน้ำ\nแล้วทำไมผมไม่เปียก?",
			"หยาดเข้าโรงพยาบาล\nแล้วหยาดเป็นอะไร?",
			"สแคร์รู๊ท 3 ส่วน h เท่ากับเท่าไหร่?",
			"รู้ไหมว่าถ้าฉันเป็นควาย\nฉันอยากให้เธอเป็นอะไร?",
			"แมวอะไรเอ่ย ห้ามขับ?",
			"ถ้าหายใจไม่ออกคุณต้องทำอย่างไร?",
			"สมมุติว่าแมวผสมกับยีราฟจะเป็นอะไร?",
			"ปลาอะไรไม่มีสัมมาคาราวะ?",
			"ไก่ 1ตัวมี 2ขา แล้วไก่ 2ขา มีกี่ตัว?",
			"ยายบัวไม่ได้เลี้ยงเป็ดเลี้ยงไก่\nแล้วยายบัวเอาไข่ที่ไหนมากิน?",
					
       };

	public static final String  ANSWERS[] = {
			"ตอบ  เพราะผมยืนดูพอลล่าอยู่ข้างบน\n\tไม่ได้โดดลงไปด้วย",
			"ตอบ  หยาด เป็นประธาน\n\tเข้า เป็นกริยา\n\tโรงพยาบาล เป็นกรรม)",
			"ตอบ  ต้นไม้ตาย\n\t(3=three หาร h ก็เหลือ tree ต้นไม้)\n\tต้นไม้ถอดรากออก ก็ กลายเป็นต้นไม้ตาย",
			"ตอบ  เป็นโคลน ฉันจะได้จมปลัก รักเธอไง",
			"ตอบ  แมวเล้า (เมาแล้ว)",
			"ตอบ  หายใจเข้า\n\t(หายใจออกจนสุดแล้วก็ต้องหายใจเข้า)",
			"ตอบ  เป็นเรื่องสมมุติ",
			"ตอบ  ปลาตาย (มันไม่ไหว้)",
			"ตอบ  มีทั่วไป (ไก่ที่ไหนๆก็มี 2 ขาทั้งนั้นแหละ)",
			"ตอบ  ไข่ไก่ เพราะไม่ได้เลี้ยงเป็ด แต่เลี้ยงไก่",

	};

}
